Pandas
1. pandas概述
2. pandas简单使用
2.1. pandas.Series对象
2.2. pandas.DataFrame对象
2.3. pandas.Index对象
3. Pandas运算方法
3.1. 对通用函数保留索引和列标签
3.2. 自动对齐索引
3.3. DataFrame和Series的运算
4. 缺失值的处理
4.1. 对NaN不敏感的操作函数
4.2. 缺失值的发现
4.3. 剔除缺失值
4.4. 填充缺失值
5. 层级索引
5.1. 层级索引的创建
5.2. 多级索引
5.3. 多级索引的的取值和切片
5.4. 多级索引的行列转换
6. 合并数据
6.1. pandas.concat
6.2. pandas.merge合并
7. 累计和分组
7.1. describe函数
7.2. GroupBy
7.3. GroupBy对象
7.4. 累计，过滤和转换
7.5. 设置分割的键
8. 数据透视表
8.1. 数据透视表的初步使用
8.2. pivot_table
8.3. 创建多级索引形状的DataFrame结果

Numpy

1. Numpy概述
2. Numpy数据类型
3. Numpy数组基础
3.5.数组的变形
3.6.数组的拼接和分裂
4. Numpy通用函数(ufunc)
5. 聚合
5.1.适用通用函数的聚合函数
5.2.数组值求和
5.3.最大值和最小值
5.4.多维度聚合
6. 广播
6.1.广播的介绍
6.2.广播的规则

Matplotlib
	•	1. Matplotlib绘图简介
	•	2. 图形简单绘制
	◦	2.1. 绘制简单图形
	◦	2.2. 调整图形风格
	◦	2.3. 调整坐标轴
	◦	2.5. 配置颜色条
	▪	2.5.1. 简单颜色条配置
	▪	2.5.2. 配置颜色条
	▪	2.5.3. 离散型颜色条
	•	3. 散点图
	•	4. 误差线
	•	10. 三维图


selenium
- 简介：
- 环境准备
- 构建浏览器对象
- 访问页面
- 查找元素
- 元素处理
- 获取页面代码
- 等待
- cookies操作

实战项目-爬取招聘岗位信息
实战项目-就业市场岗位分析实战
